liltaket/mowglinext-f401-rm1000/firmware/stm32/ros_usbnode/src/drivemotor.c
/****************************************************************************
* Title                 :   drive motor module
* Filename              :   drivemotor.c
* Author                :   Nekraus
* Origin Date           :   18/08/2022
* Version               :   1.0.0

*****************************************************************************/
/** \file drivemotor.c
 *  \brief drive motor module
 *
 */
/******************************************************************************
 * Includes
 *******************************************************************************/
#include <math.h>
#include <stdlib.h>
#include <string.h>

#include "stm32f_board_hal.h"

#include "adc.h"
#include "board.h"
#include "emergency.h"
#include "main.h"
#include "pac5210_drive_request.h"
#include "ros/ros_custom/cpp_main.h"

#include "drivemotor.h"
#include "fw_param_catalog.h"

/******************************************************************************
 * Module Preprocessor Constants
 *******************************************************************************/
#define DRIVEMOTOR_LENGTH_INIT_MSG 38
#define DRIVEMOTOR_LENGTH_RQST_MSG 12
#define DRIVEMOTOR_LENGTH_RECEIVED_MSG 20
#define DRIVEMOTOR_FEEDBACK_TIMEOUT_MS 75u

/* Kinematic ceiling on per-frame encoder motion. cmd_vel is capped to the runtime max_mps,
 * so in one ~20 ms controller frame a wheel advances at most
 *   max_mps * ticks_per_meter * 0.02 s  ticks.
 * The x3 factor is slack for frame-time jitter; a "reset" whose remainder
 * exceeds this is not real motion (a glitch) and is dropped, not accumulated.
 */
#define DRIVEMOTOR_MIN_TICKS_PER_M 50.0f
#define DRIVEMOTOR_MAX_TICKS_PER_M 5000.0f
/* The runtime max-speed cap (fw_params, protocol v7) is clamped to the absolute
 * envelope of fw_param_catalog.h; the compile-time MAX_MPS is its default. */
/******************************************************************************
 * Module Preprocessor Macros
 *******************************************************************************/

/******************************************************************************
 * Module Typedefs
 *******************************************************************************/
typedef enum {
  DRIVEMOTOR_INIT_1,
  DRIVEMOTOR_INIT_2,
  DRIVEMOTOR_RUN,
  DRIVEMOTOR_BACKWARD,
  DRIVEMOTOR_WAIT
} DRIVEMOTOR_STATE_e;

typedef struct {
  /* 0*/ uint16_t u16_preambule;
  /* 2*/ uint8_t u8_length;
  /* 3*/ uint16_t u16_id;
  /* 5*/ uint8_t u8_direction;
  /* 6*/ uint8_t u8_left_speed;
  /* 7*/ uint8_t u8_right_speed;
  /* 8*/ uint16_t u16_ukndata0;
  /*10*/ uint8_t u8_left_power;
  /*11*/ uint8_t u8_right_power;
  /*12*/ uint8_t u8_error;
  /*13*/ uint16_t u16_left_ticks;
  /*15*/ uint16_t u16_right_ticks;
  /*17*/ uint8_t u8_left_ukn;
  /*18*/ uint8_t u8_right_ukn;
  /*19*/ uint8_t u8_CRC;
} __attribute__((__packed__)) DRIVEMOTORS_data_t;

/* Per-wheel travel-direction filter (see resolve_direction /
 * DRIVEMOTOR_App_Rx). Holds the last *confirmed* physical direction so the
 * motor controller's one-frame-early direction flip on a reversal cannot
 * mis-sign coast ticks. */
typedef struct {
  int8_t s8Eff;     /* committed/published travel direction (-1/0/+1)        */
  uint8_t u8Resets; /* counter resets counted during an unconfirmed reversal */
} DRIVEMOTOR_dirfilter_t;

/******************************************************************************
 * Module Variable Definitions
 *******************************************************************************/
UART_HandleTypeDef DRIVEMOTORS_USART_Handler; // UART  Handle

DMA_HandleTypeDef hdma_usart2_rx;
DMA_HandleTypeDef hdma_usart2_tx;

static DRIVEMOTOR_STATE_e drivemotor_eState = DRIVEMOTOR_INIT_1;
static rx_status_e drivemotors_eRxFlag = RX_WAIT;
static volatile uint32_t drivemotor_last_valid_tick = 0u;
static volatile uint32_t drivemotor_fault_sequence = 0u;
static volatile uint8_t drivemotor_seen_valid = 0u;
static volatile uint8_t drivemotor_last_error = 0u;
static volatile uint8_t drivemotor_host_zero_intent = 1u;

static DRIVEMOTORS_data_t drivemotor_psReceivedData = {0};
static uint8_t drivemotor_pu8RqstMessage[DRIVEMOTOR_LENGTH_RQST_MSG] = {
    0x55, 0xaa, 0x08, 0x10, 0x80, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};

const uint8_t drivemotor_pcu8Preamble[5] = {0x55, 0xAA, 0x10, 0x01, 0xE0};
// const uint8_t drivemotor_pcu8InitMsg[DRIVEMOTOR_LENGTH_INIT_MSG] = { 0x55,
// 0xaa, 0x08, 0x10, 0x80, 0xa0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x37};
const uint8_t drivemotor_pcu8InitMsg[DRIVEMOTOR_LENGTH_INIT_MSG] = {
    0x55, 0xaa, 0x22, 0x10, 0x80, 0x00, 0x00, 0x00, 0x00, 0x02,
    0xC8, 0x46, 0x0C, 0x00, 0x00, 0x00, 0x00, 0x05, 0x0F, 0x14,
    0x96, 0x0A, 0x1E, 0x5a, 0xfa, 0x05, 0x0A, 0x14, 0x32, 0x40,
    0x04, 0x20, 0x01, 0x00, 0x00, 0x2C, 0x01, 0xEE};

uint16_t prev_right_encoder_val = 0;
uint16_t prev_left_encoder_val = 0;
/* Last *confirmed* per-wheel direction + reset-bracket counters. Replaces the
 * old prev_*_direction / prev_*_wheel_speed_val edge-prediction fence, which
 * raced the controller's reset latency and mis-signed reversal coast ticks. */
static DRIVEMOTOR_dirfilter_t left_dir_filter = {0, 0};
static DRIVEMOTOR_dirfilter_t right_dir_filter = {0, 0};
uint32_t right_encoder_ticks = 0;
uint32_t left_encoder_ticks = 0;
int32_t right_ticks_signed =
    0; /**< Cumulative SIGNED encoder ticks (polarity = direction) */
int32_t left_ticks_signed = 0;
int8_t left_direction = 0;
int8_t right_direction = 0;
uint16_t right_encoder_val = 0;
uint16_t left_encoder_val = 0;
int16_t right_wheel_speed_val = 0;
int16_t left_wheel_speed_val = 0;
uint8_t right_power = 0;
uint8_t left_power = 0;

uint32_t DRIVEMOTOR_u32ErrorCnt = 0;
volatile float g_ticks_per_meter = (float)TICKS_PER_M;
/* Runtime max wheel-speed cap. Seeded with the compile-time MAX_MPS; init_ROS()
 * then applies the persisted value (fw_params). See drivemotor_clamp_max_mps. */
volatile float g_max_mps = (float)MAX_MPS;

static float drivemotor_clamp_ticks_per_meter(float ticks_per_meter) {
  if (!isfinite(ticks_per_meter) || ticks_per_meter <= 0.0f) {
    return (float)TICKS_PER_M;
  }
  if (ticks_per_meter < DRIVEMOTOR_MIN_TICKS_PER_M) {
    return DRIVEMOTOR_MIN_TICKS_PER_M;
  }
  if (ticks_per_meter > DRIVEMOTOR_MAX_TICKS_PER_M) {
    return DRIVEMOTOR_MAX_TICKS_PER_M;
  }
  return ticks_per_meter;
}

/* Clamp the runtime max-speed cap to the absolute envelope. An invalid value
 * falls back to the compiled MAX_MPS. */
static float drivemotor_clamp_max_mps(float max_mps) {
  if (!isfinite(max_mps) || max_mps <= 0.0f) {
    return (float)MAX_MPS;
  }
  if (max_mps < FW_ENVELOPE_MAX_MPS_MIN) {
    return FW_ENVELOPE_MAX_MPS_MIN;
  }
  if (max_mps > FW_ENVELOPE_MAX_MPS_MAX) {
    return FW_ENVELOPE_MAX_MPS_MAX;
  }
  return max_mps;
}

static uint32_t drivemotor_max_ticks_per_frame(void) {
  const float ticks_per_meter =
      drivemotor_clamp_ticks_per_meter(g_ticks_per_meter);
  return (uint32_t)(drivemotor_clamp_max_mps(g_max_mps) * ticks_per_meter *
                    0.02f * 3.0f);
}

static uint8_t left_speed_req;
static uint8_t right_speed_req;
static uint8_t left_dir_req;
static uint8_t right_dir_req;

/* No host-side PWM deadband: the PAC5210 drive-motor controller runs its
 * own internal loop and handles sub-threshold commands gracefully (this
 * is how the original cedbossneo/mowgli firmware behaved, and it worked
 * fine). Adding a host-side deadband promotion on 2026-04-19 introduced
 * a 2.5× angular overshoot at low wz — any command between [-34, -1] ∪
 * [1, 34] got snapped to ±35, so wz=0.30 rad/s produced physical rotation
 * at ~0.72 rad/s. Confirmed in Voie C Test 2026-04-24 (commanded 90°
 * → measured 225° physical). The fix is to pass PWM through unchanged
 * and let the motor controller handle its own dynamics. */

