liltaket/mowglinext-f401-rm1000/firmware/stm32/ros_usbnode/src/drivemotor.c
/******************************************************************************
 * Function Prototypes
 *******************************************************************************/
__STATIC_INLINE void drivemotor_prepareMsg(uint8_t left_speed,
                                           uint8_t right_speed,
                                           uint8_t left_dir, uint8_t right_dir);

/******************************************************************************
 *  Public Functions
 *******************************************************************************/

/// @brief Initialize STM32 hardware UART to control drive motors
/// @param
void DRIVEMOTOR_Init(void) {
  PAC5210RESET_GPIO_CLK_ENABLE();
  GPIO_InitTypeDef GPIO_InitStruct;
  GPIO_InitStruct.Pin = PAC5210RESET_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
  HAL_GPIO_Init(PAC5210RESET_GPIO_PORT, &GPIO_InitStruct);
  HAL_GPIO_WritePin(PAC5210RESET_GPIO_PORT, PAC5210RESET_PIN,
                    0); // take Drive Motor PAC out of reset if LOW

  // PD7 (->PAC5210 PC4), PD8 (->PAC5210 PC3)
  __HAL_RCC_GPIOD_CLK_ENABLE();
  GPIO_InitStruct.Pin = GPIO_PIN_7 | GPIO_PIN_8;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);
  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_7 | GPIO_PIN_8, 1);

  // enable port and usart clocks
  DRIVEMOTORS_USART_GPIO_CLK_ENABLE();
  DRIVEMOTORS_USART_USART_CLK_ENABLE();

#if BOARD_YARDFORCE500_VARIANT_ORIG
  // RX
  GPIO_InitStruct.Pin = DRIVEMOTORS_USART_RX_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
  HAL_GPIO_Init(DRIVEMOTORS_USART_RX_PORT, &GPIO_InitStruct);

  // TX
  GPIO_InitStruct.Pin = DRIVEMOTORS_USART_TX_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
  HAL_GPIO_Init(DRIVEMOTORS_USART_TX_PORT, &GPIO_InitStruct);

  // Alternate Pin Set ?
  __HAL_AFIO_REMAP_USART2_ENABLE();
#elif BOARD_YARDFORCE500_VARIANT_B
  // RX TX
  GPIO_InitStruct.Pin = DRIVEMOTORS_USART_TX_PIN | DRIVEMOTORS_USART_RX_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF7_USART2;
  HAL_GPIO_Init(DRIVEMOTORS_USART_TX_PORT, &GPIO_InitStruct);
#endif

  DRIVEMOTORS_USART_Handler.Instance = DRIVEMOTORS_USART_INSTANCE; // USART2
  DRIVEMOTORS_USART_Handler.Init.BaudRate = 115200;                // Baud rate
  DRIVEMOTORS_USART_Handler.Init.WordLength =
      UART_WORDLENGTH_8B; // The word is  8  Bit format
  DRIVEMOTORS_USART_Handler.Init.StopBits = USART_STOPBITS_1; // A stop bit
  DRIVEMOTORS_USART_Handler.Init.Parity = UART_PARITY_NONE;   // No parity bit
  DRIVEMOTORS_USART_Handler.Init.HwFlowCtl =
      UART_HWCONTROL_NONE; // No hardware flow control
  DRIVEMOTORS_USART_Handler.Init.Mode = USART_MODE_TX_RX; // Transceiver mode

  HAL_UART_Init(&DRIVEMOTORS_USART_Handler);

  /* USART2 DMA Init */
  /* USART2_RX Init */
#if BOARD_YARDFORCE500_VARIANT_ORIG
  hdma_usart2_rx.Instance = DMA1_Channel6;
#elif BOARD_YARDFORCE500_VARIANT_B
  hdma_usart2_rx.Instance = DMA1_Stream5;
  hdma_usart2_rx.Init.Channel = DMA_CHANNEL_4;
  hdma_usart2_rx.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
#endif
  hdma_usart2_rx.Init.Direction = DMA_PERIPH_TO_MEMORY;
  hdma_usart2_rx.Init.PeriphInc = DMA_PINC_DISABLE;
  hdma_usart2_rx.Init.MemInc = DMA_MINC_ENABLE;
  hdma_usart2_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
  hdma_usart2_rx.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
  hdma_usart2_rx.Init.Mode = DMA_NORMAL;
  hdma_usart2_rx.Init.Priority = DMA_PRIORITY_LOW;
  if (HAL_DMA_Init(&hdma_usart2_rx) != HAL_OK) {
    Error_Handler();
  }

  __HAL_LINKDMA(&DRIVEMOTORS_USART_Handler, hdmarx, hdma_usart2_rx);

  // USART2_TX Init */
#if BOARD_YARDFORCE500_VARIANT_ORIG
  hdma_usart2_tx.Instance = DMA1_Channel7;
#elif BOARD_YARDFORCE500_VARIANT_B
  hdma_usart2_tx.Instance = DMA1_Stream6;
  hdma_usart2_tx.Init.Channel = DMA_CHANNEL_4;
  hdma_usart2_tx.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
#endif
  hdma_usart2_tx.Init.Direction = DMA_MEMORY_TO_PERIPH;
  hdma_usart2_tx.Init.PeriphInc = DMA_PINC_DISABLE;
  hdma_usart2_tx.Init.MemInc = DMA_MINC_ENABLE;
  hdma_usart2_tx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
  hdma_usart2_tx.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
  hdma_usart2_tx.Init.Mode = DMA_NORMAL;
  hdma_usart2_tx.Init.Priority = DMA_PRIORITY_HIGH;
  if (HAL_DMA_Init(&hdma_usart2_tx) != HAL_OK) {
    Error_Handler();
  }
  __HAL_LINKDMA(&DRIVEMOTORS_USART_Handler, hdmatx, hdma_usart2_tx);

  // enable IRQ
  HAL_NVIC_SetPriority(DRIVEMOTORS_USART_IRQ, 0, 0);
  HAL_NVIC_EnableIRQ(DRIVEMOTORS_USART_IRQ);

  __HAL_UART_ENABLE_IT(&DRIVEMOTORS_USART_Handler, UART_IT_TC);

  right_encoder_ticks = 0;
  left_encoder_ticks = 0;
  prev_right_encoder_val = 0;
  prev_left_encoder_val = 0;
  left_dir_filter = (DRIVEMOTOR_dirfilter_t){0, 0};
  right_dir_filter = (DRIVEMOTOR_dirfilter_t){0, 0};
}

/// @brief handle drive motor messages
/// @param
void DRIVEMOTOR_App_10ms(void) {

  static uint32_t l_u32Timestamp = 0;

  switch (drivemotor_eState) {
  case DRIVEMOTOR_INIT_1:

    HAL_UART_Transmit_DMA(&DRIVEMOTORS_USART_Handler,
                          (uint8_t *)drivemotor_pcu8InitMsg,
                          DRIVEMOTOR_LENGTH_INIT_MSG);
    drivemotor_eState = DRIVEMOTOR_RUN;
    debug_printf(" * Drive Motor Controller initialized\r\n");
    break;

  case DRIVEMOTOR_RUN:

    if (!DRIVEMOTOR_FeedbackHealthy()) {
      MOTORLINK_ForceInhibit();
    }

    /* prepare to receive the message before to launch the command */
    HAL_UART_Receive_DMA(&DRIVEMOTORS_USART_Handler,
                         (uint8_t *)&drivemotor_psReceivedData,
                         sizeof(DRIVEMOTORS_data_t));

