liltaket/mowglinext-f401-rm1000/firmware/stm32/ros_usbnode/src/drivemotor.c
    /*
     * Fold each wheel's controller frame into its tick totals and resolve
     * the true travel direction (DRIVEMOTOR_UpdateWheel / resolve_direction).
     * Reset detection is now DIRECT — any drop in the per-wheel counter is a
     * reset, so the new value is the post-reset progress (a glitch beyond one
     * frame's kinematic limit is dropped). The publishable direction is held
     * at the old sign through a reversal until the speed byte or a second
     * reset confirms the wheel has truly turned around, so the coast ticks
     * the controller emits one frame early are never mis-signed. This
     * replaces the old predict-the-reset fence + raw-direction signing, which
     * raced the controller's reset latency and corrupted left/right_ticks_
     * signed (and thus /wheel_odom + the wheel-PI loop) on every reversal.
     */
    int8_t l_s8EffLeftDir = DRIVEMOTOR_UpdateWheel(
        &left_dir_filter, left_direction,
        drivemotor_psReceivedData.u8_left_speed, left_encoder_val,
        &prev_left_encoder_val, &left_encoder_ticks, &left_ticks_signed);
    int8_t l_s8EffRightDir = DRIVEMOTOR_UpdateWheel(
        &right_dir_filter, right_direction,
        drivemotor_psReceivedData.u8_right_speed, right_encoder_val,
        &prev_right_encoder_val, &right_encoder_ticks, &right_ticks_signed);

    /* Sign the reported speed magnitude by the CONFIRMED direction too, so
     * the host's velocity sign agrees with the signed-tick trend. */
    left_wheel_speed_val =
        l_s8EffLeftDir * drivemotor_psReceivedData.u8_left_speed;
    right_wheel_speed_val =
        l_s8EffRightDir * drivemotor_psReceivedData.u8_right_speed;

    wheelTicks_handler(left_ticks_signed, right_ticks_signed,
                       left_wheel_speed_val, right_wheel_speed_val);

    drivemotors_eRxFlag = RX_WAIT; // ready for next message
  }
}

void DRIVEMOTOR_SetHostZeroMotionIntent(uint8_t zero_intent) {
  drivemotor_host_zero_intent = zero_intent != 0u;
}

void DRIVEMOTOR_SetTicksPerMeter(float ticks_per_meter) {
  g_ticks_per_meter = drivemotor_clamp_ticks_per_meter(ticks_per_meter);
}

float DRIVEMOTOR_GetTicksPerMeter(void) {
  return drivemotor_clamp_ticks_per_meter(g_ticks_per_meter);
}

void DRIVEMOTOR_SetMaxMps(float max_mps) {
  g_max_mps = drivemotor_clamp_max_mps(max_mps);
}

float DRIVEMOTOR_GetMaxMps(void) { return drivemotor_clamp_max_mps(g_max_mps); }

/**
 * @brief  Set drive motor speeds from a signed PWM command per wheel.
 *
 * Single scalar per wheel encodes both magnitude and direction: positive =
 * forward, negative = reverse, 0 = stop. The motor-controller PCB's legacy
 * (|speed|, direction-bit) interface is produced internally by this function.
 *
 * No host-side deadband: the PAC5210 motor controller handles sub-threshold
 * commands on its own. Saturates to 8-bit motor-controller magnitude range.
 *
 * @param  left_pwm_signed   signed PWM command for the left wheel
 * @param  right_pwm_signed  signed PWM command for the right wheel
 */
void DRIVEMOTOR_SetSpeedSigned(int16_t left_pwm_signed,
                               int16_t right_pwm_signed) {
  const Pac5210DriveRequest request =
      pac5210_request_from_signed_pwm(left_pwm_signed, right_pwm_signed);
  left_speed_req = request.left_speed;
  right_speed_req = request.right_speed;
  left_dir_req = (request.direction & 0xc0u) == 0xc0u ? 1u : 0u;
  right_dir_req = (request.direction & 0x30u) == 0x30u ? 1u : 0u;
}

/**
 * @brief  Legacy 4-argument form kept as a thin shim over the signed API so
 *         any caller that still uses `(speed, speed, dir, dir)` keeps
 *         working. New code should call DRIVEMOTOR_SetSpeedSigned directly.
 */
void DRIVEMOTOR_SetSpeed(uint8_t left_speed, uint8_t right_speed,
                         uint8_t left_dir, uint8_t right_dir) {
  const int16_t l_signed =
      left_dir ? (int16_t)left_speed : -(int16_t)left_speed;
  const int16_t r_signed =
      right_dir ? (int16_t)right_speed : -(int16_t)right_speed;
  /* If both speeds are 0, the deadband path passes 0 through unchanged,
   * matching the old "0,0,0,0 == stop" contract. */
  DRIVEMOTOR_SetSpeedSigned((left_speed == 0) ? 0 : l_signed,
                            (right_speed == 0) ? 0 : r_signed);
}

/// @brief drive motor receive interrupt handler
/// @param
void DRIVEMOTOR_ReceiveIT(void) {
  const uint32_t now = HAL_GetTick();
  /* decode the frame */
  if (memcmp(drivemotor_pcu8Preamble, (uint8_t *)&drivemotor_psReceivedData,
             5) == 0) {
    uint8_t l_u8crc = crcCalc((uint8_t *)&drivemotor_psReceivedData,
                              DRIVEMOTOR_LENGTH_RECEIVED_MSG - 1);
    if (drivemotor_psReceivedData.u8_CRC == l_u8crc) {
      drivemotors_eRxFlag = RX_VALID;
      if (drivemotor_seen_valid != 0u &&
          (uint32_t)(now - drivemotor_last_valid_tick) >
              DRIVEMOTOR_FEEDBACK_TIMEOUT_MS) {
        ++drivemotor_fault_sequence;
        MOTORLINK_ForceInhibit();
      }
      drivemotor_seen_valid = 1u;
      drivemotor_last_valid_tick = now;
      drivemotor_last_error = drivemotor_psReceivedData.u8_error != 0u;
      if (drivemotor_last_error != 0u) {
        ++drivemotor_fault_sequence;
        MOTORLINK_ForceInhibit();
      }
    } else {
      drivemotors_eRxFlag = RX_CRC_ERROR;
      ++drivemotor_fault_sequence;
      MOTORLINK_ForceInhibit();
    }
  } else {
    drivemotors_eRxFlag = RX_INVALID_ERROR;
    ++drivemotor_fault_sequence;
    MOTORLINK_ForceInhibit();
  }
}

bool DRIVEMOTOR_FeedbackHealthy(void) {
  return drivemotor_seen_valid != 0u && drivemotor_last_error == 0u &&
         (uint32_t)(HAL_GetTick() - drivemotor_last_valid_tick) <=
             DRIVEMOTOR_FEEDBACK_TIMEOUT_MS;
}

uint32_t DRIVEMOTOR_FaultSequence(void) { return drivemotor_fault_sequence; }

/******************************************************************************
 *  Private Functions
 *******************************************************************************/

__STATIC_INLINE void drivemotor_prepareMsg(uint8_t left_speed,
                                           uint8_t right_speed,
                                           uint8_t left_dir,
                                           uint8_t right_dir) {

  Pac5210DriveRequest request = {
      (uint8_t)((right_dir ? 0x30u : 0x20u) |
                (left_dir ? 0xc0u : 0x80u)),
      left_speed,
      right_speed};
  const bool stop = pac5210_should_stop_output(
      Emergency_State() != 0u,
      main_eOpenmowerStatus == OPENMOWER_STATUS_IDLE,
      MOTORLINK_OutputInhibited() != 0u, DRIVEMOTOR_FeedbackHealthy(),
      drivemotor_host_zero_intent != 0u);
  request = pac5210_apply_final_output_gate(request, stop);
  pac5210_encode_drive_packet(drivemotor_pu8RqstMessage, request);
}
